---
kind: property
id: P:Autodesk.Revit.DB.IntegerRange.High
source: html/c23d12d3-8152-ecca-e42e-fcc2167e10b2.htm
---
# Autodesk.Revit.DB.IntegerRange.High Property

The upper limit of the range

## Syntax (C#)
```csharp
public int High { get; }
```